Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=491_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Olen kohta kaksikymppinen inarilaisnuori, asunut täällä koko ikäni ja vielä toistaiseksi ainakin hetken, ei ole juuri kiirettä pois.
smn: Mun lam forgâ kyevtlove ahasâš anarâšnuorâ, lam aassâm tääbbin ubâ ave já vala tuáistáážân aainâs puudâ, ij lah vala huáppu meddâl.

source: Ylioppilaaksi kirjoitin keväällä 2010 ja nyt olen pitänyt välivuoden reissaamista ja työntekoa varten.
smn: Pajeuáppen čaallim kiđđuv 2010 já tääl lam toollâm koskâive reissim ja pargo várás.

source: Kouluun on tarkoitus ensi vuonna mennä, matkailun pariin.
smn: Škoovlân ličij uáivil moonnâđ puáttee ive, mađhâšem suárgán.

source: Olen syntynyt kuusihenkiseen perheeseen toiseksi vanhimmaksi lapseksi.
smn: Lam šoddâm kuuđâ ulmuu perrui nubben puárásumos pärnin.

source: Me kolme lasta kävimme inarinsaamenkielisen päiväkodin ja opimme kielen siellä, sillä isäni ei ole oppinut saamenkieltä.
smn: Mij kulmâ párnáá juuđijm aanaarsämikielâlii peivikiäju já oopâim tobbeen kielâ, ko iäččám ij lah oppâm sämikielâ.

source: Nykyään taidot ovat jo hieman ruosteessa, mutta halu ylläpitää kielitaitoa on vahva.
smn: Tääl tááiđuh láá jo ucánjáhháá ruástum, mut haalu toollâđ kielâtááiđu lii nanos.

source: Nyt on mieli niin levoton että haluaisin mahdollisimman paljon ulkomaille, varmaan hetkeksi asumaankin, mutta haluaisin kuitenkin muuttaa vielä joskus takaisin kotikulmille Inariin.
smn: Tääl lii mielâ nuuvt liävuttem, et halijdiččim olgoenâmáid nuuvt ennuv ko máhđulâš, vissâ mottoom ááigán aassâđ-uv, mut halijdiččim kuittâg vala motomin varriđ maassâd päikkikuávloid Anarân.
